home/programs/emacs/emacs.org
#+title: Emacs Configuration
#+author: icurry
#+language: en
#+options: toc:2 num:t author:t

* Introduction and Overview

Obligatory Frieren Ascii art.

#+begin_example text
            Frieren
⠀⠀⠀⠀⠀⠀⢀⡴⢾⣶⣴⠚⣫⠏⠉⠉⠛⠛⢭⡓⢶⣶⠶⣦⡀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣰⠋⡀⣠⠟⢁⣾⠇⠀⣀⣷⠀⠀⠓⣝⠂⠙⣆⢄⢻⡞⢢⠀⠀⠀
⠀⠀⠀⠀⢠⡇⢸⢡⠃⢠⡞⠁⠀⣰⡟⠉⢦⣄⠀⠈⢆⠀⢻⣾⡄⢧⢸⠀⠀⠀
⠀⠀⠀⠀⢸⠀⡇⡌⠀⡞⠀⢀⣴⡋⠀⠀⠀⣙⣷⡀⠘⡄⠘⣿⣧⢸⣼⣥⠀⠀
⣀⣀⣀⣀⣞⣰⠁⡇⠀⣧⠴⠛⠛⠁⠀⠀⠀⠉⠉⠙⠦⡇⠀⣿⣸⣼⣿⣇⣀⣀
⠳⢽⣷⠺⡟⡿⣯⡇⠰⣧⠠⣿⡷⠂⠀⠀⠀⠐⣾⠷⠀⡀⠀⣿⡟⣴⠶⢁⡨⠊
⠀⠀⠉⢳⢦⣅⠘⣿⣄⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡇⢀⣏⣳⣿⣴⡞⠈⠀
⠀⠀⠀⣼⢸⡅⢹⣿⣿⣾⣟⠀⠀⢠⣀⣄⣠⠀⠀⢠⣾⣿⡿⣿⢻⠁⢹⣷⡀⠀
⠀⠀⠸⡏⠸⡇⢼⣿⡿⠟⠛⠓⣦⣄⣀⣀⣀⣀⡤⠴⠿⢿⡟⠛⠺⣦⣬⣗⠀⠀
⠀⠀⢰⡇⠀⡇⠸⡏⠀⠀⢰⠋⠙⠛⠛⠉⠉⢹⠀⠀⠀⠀⡇⠀⠀⣿⣿⣿⣿⡇
⠀⡐⣾⠀⡀⢹⠀⣿⣄⠀⢸⠀⠀⠀⠀⠀⠀⢸⡇⠀⠀⢠⣇⠀⠀⣿⣿⣿⣿⣿
⣰⣿⣿⠀⡇⠘⡄⢸⣿⠆⠈⡇⠀⠀⠀⠀⠈⢉⠃⠀⣰⡾⠻⠃⢰⣿⣿⣿⣿⡇
⣿⣿⣿⡆⢷⠀⢧⠈⣿⠤⠤⣇⠀⠀⠀⠀⢀⣸⣠⢾⠟⠓⡶⢤⣾⣿⣿⣿⣿⣷
#+end_example

* Initialization of Emacs (=init.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./init.el
:END:

** Emacs Version Check

I do not test this config on any emacs version less than 29.4.

#+begin_src emacs-lisp
;; ===Check Emacs Version===
(when (version< emacs-version "29.4")
  (error "This setup is only guarunteed to work on 29.4, disable this line to load anyways."))
#+end_src

** Some Basic Settings

These are some basic settings that don't really fit anywhere else in my config.

#+begin_src emacs-lisp
;; ===Basic Settings===
(setq frame-title-format "%b")      ; Set window title to buffer name
(setq initial-scratch-message ";; Scratch Buffer\n\n")
(setq initial-buffer-choice t)      ; Scratch as initial buffer
(setq make-backup-files nil)        ; No more file~ everywhere
(setq inhibit-startup-message t)    ; Starts on blank screen
(setq scroll-conservatively 101)    ; Enable Line by line scrolling
(setq use-dialog-box nil)           ; No yes-no-p for mouse clicks
(setq use-short-answers t)          ; Use y-or-n-p for yes-no dialogue.
(scroll-bar-mode -1)                ; Disable visible scrollbar
(tool-bar-mode -1)                  ; Disable tool bar
(menu-bar-mode -1)                  ; Disable menu bar
(tooltip-mode -1)                   ; Disable tooltips
(set-fringe-mode 10)                ; No idea what this does
#+end_src

** Enabling Disabled Functions

These functions I want enabled and not asking me if I want to run the command every single time.

#+begin_src emacs-lisp
;; ===Enable Disabled Functions===
(dolist (c '(narrow-to-region narrow-to-page upcase-region downcase-region))
  (put c 'disabled nil))
#+end_src

** "Disabling" Custom

Set ~custom-file~ to a temp file so I don't have to deal with custom, lol. This is a tip I learned from [[https://protesilaos.com/emacs/dotemacs#h:f2ffe0e9-a58d-4bba-9831-cc35940ea83f][Protesilaos' config]].

#+begin_src emacs-lisp
;; ===Disable Custom===
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

** Package.el and Package Archives

This is only used if I find myself on a non-nixos system, as I have nixos manage my emacs packages instead.

#+begin_src emacs-lisp
;; ===Package Initialization===
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")
                         ("nongnu" . "https://elpa.nongnu.org/nongnu/"))) ;; Setting Repos
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
#+end_src

** Use-package

Requiring ~use-package~ as that is what I use for almost all of my configuration.

#+begin_src emacs-lisp
;; ===use-package Initialization===
(require 'use-package)
#+end_src

** Configuration modules.

First, I add the =cur-lisp= and =cur-config= to the ~load-path~. Then its just as simple as ~(require 'module)~.

#+begin_src emacs-lisp
;; ===Load Modules and Packages===
(dolist (path '("cur-lisp" "cur-config"))
  (add-to-list 'load-path (locate-user-emacs-file path)))

;; =====================
;; == Loading Modules ==
;; =====================

;; ===Essentials===
(require 'cur-config-essentials)
(require 'cur-config-bindings)
(require 'cur-config-help)
(require 'cur-config-dired)

;; ===Interfaces===
(require 'cur-config-faces)
(require 'cur-config-completion)
(require 'cur-config-window)

;; ===Languages===
(require 'cur-config-ide)
(require 'cur-config-lisp)
(require 'cur-config-java)
(require 'cur-config-just)
(require 'cur-config-markup)
(require 'cur-config-nix)
(require 'cur-config-rust)
(require 'cur-config-haskell)
(require 'cur-config-ocaml)
(require 'cur-config-c)
(require 'cur-config-zig)
(require 'cur-config-go)

;; ===Terminal Apps===
(require 'cur-config-shell)

;; ===Word Processing===
(require 'cur-config-org)

;; ===Misc===
(require 'cur-config-smol-net)
(require 'cur-config-elcord)

;; ===Direnv is Last===
(require 'cur-config-direnv)

(provide 'init)
#+end_src

* Configuration Modules (=cur-config=)

** Essential configuration (=cur-config-essentials.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-essentials.el
:END:

These are the basic configurations that I have done in emacs. Its sort of a hodge-podge of fixing/changing things that are built emacs. They aren't strictly essential so the name is kind of a misnomer.

*** Parentheses highlighting

Removing the weird delay for highlighting the opposite parenthesis.

#+begin_src emacs-lisp
;; ===Parens===
(use-package paren
  :ensure nil
  :demand t
  :custom
  (show-paren-delay 0 "No delay for paren highlighting"))
#+end_src

*** Line numbers

I like having absolute line numbers, especially since the meow number selection makes relative line numbers not as useful. Some modes, especially terminal and shell modes, look weird with line numbers so I disable them. Org-mode also has them disabled because they make the document look kind of weird, especially with images or non-text.

#+begin_src emacs-lisp
;; ===Line Numbers===
(use-package emacs
  :custom
  (display-line-numbers-type t)
  :config
  (column-number-mode 1)
  (global-display-line-numbers-mode 1)
  ;; Disable line numbers for terminal modes
  (dolist (mode '(bookmark-bmenu-mode-hook
                  org-mode-hook
                  dired-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook
                  eat-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode -1)))))

#+end_src

*** Bookmark Settings

#+begin_src emacs-lisp
(use-package bookmark
  :commands (bookmark-set
             bookmark-set-no-overwrite
             bookmark-jump
             bookmark-bmenu-list)
  :hook (bookmark-bmenu-mode . hl-line-mode)
  :config
  (setq bookmark-save-flag 1))
#+end_src

*** Recent Files

#+begin_src emacs-lisp
(use-package recentf
  :hook (emacs-startup . recentf-mode))
#+end_src

*** Isearch configuration

#+begin_src emacs-lisp
(use-package isearch
  :ensure nil
  :demand t
  :custom
  (isearch-wrap-pause 'no-ding)
  (isearch-repeat-on-direction-change t)
  :config
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil))
#+end_src

*** Proced

#+begin_src emacs-lisp
(use-package proced
  :ensure nil
  :commands (proced)
  :custom
  (proced-auto-update-flag t)
  (proced-enable-color-flag t)
  (proced-auto-update-interval 2)
  (proced-descend t)
  (proced-filter 'user))
#+end_src

*** Emacs Server

#+begin_src emacs-lisp
(use-package server
  :defer 1
  :config
  (setq server-client-instructions nil)
  (unless (server-running-p)
    (server-start)))

(provide 'cur-config-essentials)
#+end_src

** Key bindings configurations (=cur-config-bindings.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-bindings.el
:END:

I use [[https:github.com/meow-edit/meow][meow]], a modal editing layer designed to be integrate well into emacs. It's very easy to hack on and extend and just feels more emacsy. I have had almost no issues with this, compared to evil which just felt sluggish and was hard to customize. The object-verb syntax is also really great and I prefer it to the verb-object of vim/nvim.

*** Repeat mode

One of the most basic ways to make using Emacs keybindings a breeze.

#+begin_src emacs-lisp
;; ===Repeat Mode===
(use-package emacs
  :demand t
  :config
  (repeat-mode 1))
#+end_src

*** Hydra 

I use hydras for repeat keybindings. I plan to switch to use the built in repeat keymap more in the future but they are very helpful for creating something almost like a mini meow state, just for one particular task.

#+begin_src text :tangle ./packages.txt :padline no
hydra
#+end_src

#+begin_src emacs-lisp
;; ===Hydra===
(use-package hydra
  :demand t)
#+end_src

*** Avy

#+begin_src text :tangle ./packages.txt :padline no
avy
#+end_src

#+begin_src emacs-lisp
(use-package avy
  :bind ( :map goto-map
	  ("c" . avy-goto-char-2)))
#+end_src

