home/programs/emacs/emacs.org
*** Meow Tree Sitter

#+begin_src text :tangle ./packages.txt :padline no
meow-tree-sitter
#+end_src

#+begin_src emacs-lisp
(use-package meow-tree-sitter
  :after meow
  :config
  (meow-tree-sitter-register-defaults))

(provide 'cur-config-bindings)
#+end_src

** Help configurations (=cur-config-help.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-help.el
:END:

Enhancing the help mechanisms in emacs.

*** Which-key

Which-key shows you what keybindings are available in a keychord. Super helpful and a must have in emacs.

#+begin_src text :tangle ./packages.txt :padline no
which-key
#+end_src

#+begin_src emacs-lisp
;; ===which-key===
(use-package which-key
  :demand t
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.0001))
#+end_src

*** Info

Info is emacs' built in manual system. In essence, its a more feature rich =man= (which emacs also has easy access to with =woman=). Right now I have a custom meow state for keybindings. However, this kind of sucks and I will eventually switch to just changing the default keybindings.

#+begin_src emacs-lisp
;; ===Info===
(use-package info
  :config
  (setq meow-info-keymap (make-keymap))
  (meow-define-state info
    "meow state for interacting with Info"
    :lighter "INFO"
    :keymap meow-info-keymap)
  (meow-define-keys 'info
    '(":" . meow-page-up)
    '("?" . meow-page-down)
    '("," . beginning-of-buffer)
    '("." . end-of-buffer)
    ;;  '("a" . )
    ;;  '("b" . )
    ;;  '("c" . Info-follow-reference)
    ;;  '("d" . )
    ;;  '("e" . )
    '("f" . Info-menu)
    '("g" . keyboard-quit)
    '("h" . Info-backward-node)
    '("H" . meow-left)
    '("i" . Info-index)
    '("j" . meow-next)
    '("k" . meow-prev)
    '("l" . Info-forward-node)
    '("L" . meow-right)
    '("m" . meow-join)
    '("n" . Info-next)
    ;;  '("o" . )
    '("p" . Info-prev)
    '("q" . meow-goto-line)
    '("r" . Info-follow-reference)
    ;;  '("s" . )
    '("t" . Info-toc)
    '("u" . Info-up)
    '("v" . meow-visit)
    ;;  '("w" . )
    ;;  '("x" . )
    '("y" . Info-copy-current-node-name)
    '("z" . info-display-manual)
    '("RET" . Info-follow-nearest-node)
    '("SPC" . meow-keypad)
    '("TAB" . Info-next-reference)
    '("<backtab>" . Info-prev-reference)
    '("<escape>" . keyboard-quit))
  (add-hook 'Info-mode-hook #'meow-info-mode))

(provide 'cur-config-help)
#+end_src

** Dired configuration (=cur-config-dired.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-dired.el
:END:

Dired is the built in file manager in emacs. Its very capable and very hackable although it lacks good file previewing solutions

*** Nerd Icons Dired

Adds icons to make dired a bit more pretty and gives a visual sense of what files are what. 

#+begin_src text :tangle ./packages.txt :padline no
nerd-icons-dired
#+end_src

#+begin_src emacs-lisp
;; ===Dired Icons===
(use-package nerd-icons-dired
  :after (dired)
  :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

*** Main Dired Configuration

By default, I want dired to look very minimal. This lack of clutter makes it easier to focus on what I am doing in the file manager. This is also the approach I try to take with other parts of emacs as well. By default, I have file details (owner, permissions, last modified, etc.) hidden. I have other changes as well, use the system trash can instead of deleting, that are under the ~:config~ part of the ~use-package~ declaration.

The keybindings are a hybrid of my normal state and the default dired keybindings.

#+begin_src emacs-lisp
;; ===Dired===
(use-package dired
  :ensure nil
  :hook
  (dired-mode . dired-hide-details-mode) ; don't show file details by default
  (dired-mode . hl-line-mode) ; Highlight the line the cursor is on
  ;; TODO: create a dired-find-file-dwim for external programs
  :bind ( :map dired-mode-map
          ;; ===Top Row===
          ;; ("1" . )
          ("!" . dired-do-shell-command)
          ;; ("2" . )
          ;; ("@" . )
          ;; ("3" . )
          ;; ("#" . )
          ;; ("4" . )
          ;; ("$" . )
          ;; ("5" . )
          ;; ("%" . )
          ;; ("6" . )
          ;; ("^" . )
          ;; ("7" . )
          ("&" . dired-do-async-shell-command)
          ;; ("8" . )
          ;; ("*" . )
          ;; ("9" . )
          ;; ("(" . )
          ;; ("0" . )
          ;; (")" . )

          ;; ===2nd Row===
          ("TAB"  . dired-hide-subdir)
          ("<backtab>" . dired-hide-all)
          ("q" . quit-window)
          ;; ("Q" . )
          ("w" . dired-mark-subdir-files)
          ;; ("W" . ) ; Bound it custom wallpaper settings
          ("e" . dired-next-subdir)
          ;; ("E" . )
          ("r" . dired-do-rename)
          ("R" . dired-do-rename-regexp)
          ("t" . dired-toggle-marks)
          ("T" . dired-kill-tree)
          ("y" . dired-copy-filename-as-kill)
          ;; ("Y" . )
          ("u" . dired-unmark)
          ("U" . dired-unmark-all-marks)
          ("i" . dired-toggle-read-only)
          ("I" . image-dired)
          ("o" . dired-do-async-shell-command)
          ("O" . dired-do-chown)
          ("p" . dired-next-marked-file)
          ;; ("P" . )
          ("-" . negative-argument)
          ;; ("_" . )

          ;; ===3rd Row===
          ("<escape>" . keyboard-quit)
          ("a" . dired-find-alternate-file)
          ;; ("A" . dired-find-alternate-file)
          ("s" . dired-kill-subdir)
          ("S" . dired-kill-tree)
          ("d" . dired-do-kill-lines)
          ("D" . dired-do-delete)
          ("f" . dired-goto-file)
          ("F" . dired-goto-subdir)
          ("g" . revert-buffer)
          ;; ("G" . )
          ("h" . dired-up-directory)
          ;; ("H" . )
          ;; ("j" . ) ; already bound in meow-motion-mode
          ;; ("J" . )
          ;; ("k" . ) ; already bound in meow-motion-mode
          ;; ("K" . )
          ;; ("l" . ) ; bound in cur-dired declaration
          ("L" . dired-find-file-other-window)
          (";" . dired-toggle-marks)
          (":" . scroll-down-command)
          ("RET" . dired-find-file)
          ("S-RET" . dired-find-file-other-window)

          ;; ===4th Row===
          ("z" . dired-undo)
          ;; ("Z" . )
          ("x" . dired-mark)
          ("X" . dired-mark-files-regexp)
          ("c" . dired-do-copy)
          ("C" . dired-do-copy-regexp)
          ("v" . dired-view-file)
          ;; ("V" . )
          ("b" . dired-prev-subdir)
          ;; ("B" . )
          ("n" . dired-next-marked-file)
          ;; ("N" . )
          ;; ("m" . )
          ("M" . dired-do-chmod)
          ("," . dired-prev-dirline)
          ("<" . beginning-of-buffer)
          ("." . dired-next-dirline)
          (">" . end-of-buffer)
          ("/" . dired-sort-toggle-or-edit)
          ("?" . scroll-up-command)
          ;; ("'"  . ) ; Leave these blank, usually embark-act
          ;; ("\"" . ) ; Leave these blank, usually embark-dwim
          :map cur/sub-leader-keymap
          ("d" . dired))
  :custom
  (dired-recursive-copies 'always)
  (dired-recursive-deletes 'always)
  (delete-by-moving-to-trash t)
  (dired-dwim-target t)
  (dired-listing-switches "-A -G -F -h -l -v --group-directories-first --time-style=long-iso")
  (dired-guess-shell-alist-user '(("\\.\\(png\\|jpe?g\\|tiff\\|gif\\)" "xdg-open" "imv" "feh")
                                  ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\|mov\\)" "xdg-open" "mpv" "vlc")
                                  ("\\.pdf" "xdg-open" "zathura")
                                  (".*" "xdg-open")))
  (dired-auto-revert-buffer #'dired-directory-changed-p)
  (dired-free-space nil)
  (dired-make-directory-clickable t)
  (dired-mouse-drag-files t)
  :config
  (setq dired-deletion-confirmer 'y-or-n-p)
  (setopt dired-do-revert-buffer (lambda (dir) (not (file-remote-p dir)))))

(use-package cur-dired
  :after (dired)
  :bind ( :map dired-mode-map
	  ("l" . cur-dired-maybe-insert-subdir-or-find-file)))

(provide 'cur-config-dired)
#+end_src

*** Wallpaper

#+begin_src emacs-lisp
(use-package cur-wallpaper
  :after (dired)
  :bind ( :map dired-mode-map
	  ("W" . cur-wallpaper-set-wallpaper-dired)))

(use-package cur-wallpaper
  :after (image-dired)
  :bind ( :map image-dired-thumbnail-mode-map
	  ("W" . cur-wallpaper-set-wallpaper)))

(provide 'cur-config-dired)
#+end_src

** Faces, themes, and eye candy configurations (=cur-config-faces.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-faces.el
:END:

I think that emacs should have a lot of eye candy, especially since I spend so much time in it. These are my configurations for emacs' faces, theming and ui settings essentially.

*** Default Font and Fontaine

JetBrains Mono supremacy.

#+begin_src text :tangle ./packages.txt :padline no
fontaine
#+end_src

#+begin_src emacs-lisp
;; ===Default Font===

(use-package fontaine
  :demand t
  :bind ( :map cur/toggle-map
	  ("C-s" . fontaine-set-preset))
  :custom
  (fontaine-presets '((regular)
		      (extra-small
		       :default-height 100)
		      (small
		       :default-height 107)
		      (large
		       :default-height 140)
		      (t
		       :default-family "JetBrainsMono Nerd Font"
		       :default-weight regular
		       :default-height 110

		       :fixed-pitch-family nil
		       :fixed-pitch-weight nil
		       :fixed-pitch-height 1.0

		       :fixed-pitch-serif-family nil
		       :fixed-pitch-serif-weight nil
		       :fixed-pitch-serif-height 1.0

		       :mode-line-active-height 1.0
		       :mode-line-inactive-height 1.0)))
  :config
  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))
  (fontaine-mode 1))
#+end_src

*** Default Opacity

I have this transparency set to be the same as with my Alacritty config. This adds more consistency to my computing experience. It also just looks really cool.

#+begin_src emacs-lisp
;; ===Default Opacity===
(add-to-list 'default-frame-alist
             '(alpha-background . 85))

(use-package emacs
  :preface
  (defun cur/toggle-frame-opacity ()
    (interactive)
    (let ((current-alpha (frame-parameter nil 'alpha-background)))
      (cond ((eq current-alpha 100)
	     (set-frame-parameter nil 'alpha-background 85))
	    (t
	     (set-frame-parameter nil 'alpha-background 100)))))
  :bind ( :map cur/toggle-map
	  ("C-o" . cur/toggle-frame-opacity)))
#+end_src

*** TODO Custom themes

I have several custom themes in a directory weirdly named themes. These are the =everforest= and =kanagawa= themes. I have changed these from the originals. TODO: add the links to the original themes.

#+begin_src emacs-lisp
;; ===Themes Path===
(add-to-list 'custom-theme-load-path (locate-user-emacs-file "themes"))

;; ===Theme Library===
(use-package cur-theme
  :bind ( :map cur/toggle-map
          ("C-t" . cur-override-theme-load-theme))
  :custom
  (cur-override-theme-overrides
   '((catppuccin (company-preview :foreground (catppuccin-color 'overlay0)
				  :background (if (eq catppuccin-flavor 'latte)
						  (catppuccin-darken (catppuccin-color 'base) 12)
						(catppuccin-lighten (catppuccin-color 'base) 17)))
		 (cur-mode-line-meow-state :background (catppuccin-color 'lavender)
					   :foreground (catppuccin-color 'base))
		 (cur-mode-line-major-mode-active :foreground (catppuccin-color 'blue) :weight 'bold)
		 (flycheck-info :underline (list :style 'wave :color (catppuccin-color 'green)))
		 (flycheck-warning :underline (list :style 'wave :color (catppuccin-color 'yellow)))
		 (flycheck-error :underline (list :style 'wave :color (catppuccin-color 'red))))
     (doom-gruvbox (secondary-selection :background "#504945")
		   (cur-mode-line-major-mode-active :foreground "#83a598"
						    :weight 'bold))
     (doom-oceanic-next (cur-mode-line-major-mode-active :foreground "#6699CC"
							 :weight 'bold))
     (doom-flatwhite (haskell-operator-face :background "#f7f3ee"
                                            :foreground "#605a52")
                     (haskell-type-face :background "#d2ebe3"
                                        :foreground "#465953")
                     (haskell-constructor-face :background "#f7e0c3"
                                               :foreground "#5b5143")
		     (completions-common-part :background "#dde4f2"
					      :foreground "#7382a0"
					      :weight 'bold)
		     (org-dispatcher-highlight :background "#f7e0c3"
					       :foreground "#957f5f")
		     (help-key-binding :background "#f7f3ee"
				       :foreground "#7382a0")
		     (fill-column-indicator :foreground "#b9a992")
		     (org-block :foreground "#93836c"
				:background "#f1ece4"))
     (doom-nord (mode-line :background "#3b4252")
		(mode-line-inactive :foreground "#88c0d0"
				    :background "#3b4252")
		(hl-line :background "#3b4252")
		(font-lock-comment-face :foreground "#4c566a")
		(org-block-begin-line :foreground "#d8dee9"
				      :background "#3b4252"
				      :inherit 'org-block
				      :extend t)
		(org-block :background "#2e3440")
		(dired-broken-symlink :foreground "#ebcb8b"
				      :background "#bf616a")
		(meow-beacon-fake-selection :foreground "#d8dee9"
					    :weight 'bold)
		(secondary-selection :background "#3b4252")
		(vertical-border :foreground "#3b4252"
				 :background "#3b4252")
		(help-key-binding :foreground "#88c0d0"
				  :background "#2e3440"
				  :box '(:line-width 1 :color "#4c566a")
				  :inherit 'fixed-pitch)
		(corfu-default :foreground "#eceff4"
			       :background "#3b4252")
		(corfu-current :foreground "#eceff4"
			       :background "#434c5e")
		(aw-leading-char-face :foreground "#bf616a" :height 1.3)
		(aw-background-face :foreground "#4c566a")))))
#+end_src

*** Doom themes

Doom themes are a theme pack specifically for the Doom Emacs distribution, but work well without doom as well. I have a function that sets some faces based on the theme in ~custom-enabled-themes~. This function is more than just a little jank and I plan on creating my own themes instead of trying to hack around ones made by someone else.

#+begin_src text :tangle ./packages.txt :padline no
doom-themes
#+end_src

#+begin_src emacs-lisp
;; ===Doom Emacs Themes===
(use-package doom-themes
  :demand t)
  ;; :config
  ;; (cur-override-theme-load-theme 'doom-flatwhite))
#+end_src

*** Autothemer

A library used by =catppuccin= and =kanagawa=.

#+begin_src text :tangle ./packages.txt :padline no
autothemer
#+end_src

#+begin_src emacs-lisp
;; ===Autothemer===
(use-package autothemer)
#+end_src

*** Catppuccin Theme

[[https:github.com/catppuccin/catppuccin][Link]] to the catppuccin theme.

#+begin_src text :tangle ./packages.txt :padline no
catppuccin-theme
#+end_src

#+begin_src emacs-lisp
;; ===Catppuccin Theme===
(use-package catppuccin-theme
  :after (autothemer cur-theme))
#+end_src

*** Default Theme

#+begin_src emacs-lisp
(cur-override-theme-load-theme 'catppuccin)
#+end_src

*** Ef-themes

Themes made by Protesilaos, also known as Prot.

#+begin_src text :tangle ./packages.txt :padline no
ef-themes
#+end_src

#+begin_src emacs-lisp
;; ===Ef-Themes===
(use-package ef-themes)
;; :config
;; (cur/load-theme 'ef-tritanopia-dark))
#+end_src

*** Nerd Icons Ibuffer

Adds Icons to ~ibuffer~. Not really a face thing but I don't have a dedicated ~ibuffer~ module so it goes here instead.

#+begin_src text :tangle ./packages.txt :padline no
nerd-icons-ibuffer
#+end_src

#+begin_src emacs-lisp
;; ===Ibuffer Icons===
(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

