home/programs/emacs/cur-config/cur-config-bindings.el

(use-package meow-tree-sitter
  :after meow
  :config
  (meow-tree-sitter-register-defaults))

(provide 'cur-config-bindings)
